import random

people = [
    '고영진','구본웅','김성용','김하늘','김하림',
    '김현아','민경현','배이경','서동훈','송준우',
    '심현재','유창재','윤민영','윤태영','이민호',
    '이성섭','이성우','이영아','이예슬','임수형',
    '임혜진','정선재','정현아','진익근','최태호',
    '최홍준','하정호','허주혁'
  ]

random.shuffle(people)                                    # random 모듈의 shuffle 기능으로 명단 리스트를 무작위 정렬한다.

teamnum = 0                                               # 몇 조인지 써줄 숫자 시작을 0으로 설정

for num in range(7) :                                     # 총 4명씩 7조를 만들 것이므로, 7조까지 4명씩 슬라이싱한다.
  member = ', '.join(people[num*4:num*4+4])               # 4명이 추출된 리스트를 join 메서드로 ', '를 기준으로 한 문자열로 정리하여 member 변수에 할당한다. (리스트 말고 문자열로 하려고)
  teamnum += 1                                            # 반복할 때마다 몇 조인지를 나타내는 teamnum에 1을 더해준다
  print('=============================================')
  print(f'| {teamnum}조 멤버 : {member} |')                # print를 통해 조와 멤버들을 출력
print('=============================================')    # 그냥 꾸미기용 =====




# team1 = ', '.join(people[0:4])                            # 무작위 정렬된 명단에서 4명씩 뽑아 조를 만든다.
# team2 = ', '.join(people[4:8])
# team3 = ', '.join(people[8:12])
# team4 = ', '.join(people[12:16])
# team5 = ', '.join(people[16:20])
# team6 = ', '.join(people[20:24])
# team7 = ', '.join(people[24:28])

# print('=============================================')
# print(f'| 1조 멤버 : {team1} |')                           # 각 조를 출력
# print('=============================================')
# print(f'| 2조 멤버 : {team2} |')
# print('=============================================')
# print(f'| 3조 멤버 : {team3} |')
# print('=============================================')
# print(f'| 4조 멤버 : {team4} |')
# print('=============================================')
# print(f'| 5조 멤버 : {team5} |')
# print('=============================================')
# print(f'| 6조 멤버 : {team6} |')
# print('=============================================')
# print(f'| 7조 멤버 : {team7} |')
# print('=============================================')